[
  {
    "content": "About PMKSY Components AIBP Har Khet Ko Pani Per Drop More Crop-Micro Irrigation(MI) Per Drop More Crop-Other Interventions(SWMA) Watershed Convergence with MGNREGA Guidelines AIBP CADWM MI Programme Guideline Watershed MGNREGA Minutes of Meeting Circular Dashboard Micro Irrigation Fund Media Presentations Events Photo Gallery News Videos MIS Reports Achievement Reports Consolidate Activity wise OTF One Touch Format DIP Document Uploded PMKSY-PDMC-MI Workflow System Drill-Down Progress Reports a",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 0
  },
  {
    "content": ").MIS Reports (Odisha) b).Progress Reports (Odisha) Contacts Area Covered (2022-23) Micro IrrigationDrip : 5.32 Lakh HaSprinkler : 5.70 Lakh HaTotal : 11.02 Lakh HaOther InterventionsPotential Created For Protective Irrigation : 0.05 Lakh Ha Quick Links PMKSY - MIS (OTF) Brief of Status of Micro-Irrigation Fund (MIF) created under NABARD Per Drop More Crop - Other Interventions (SWMA) Login DIP Document Uploaded DIP Template Common Format for One Touch Information on PMKSY PMKSY Guidelines Centr",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 1
  },
  {
    "content": "al Water Commission Central Ground Water Board Election Commission of India Form of Utilization Certificate - GFR19 A (Rule 212(1)) PMKSY OI - User Manual PMKSY MI - User Manual BHUVAN PDMC APP - User Manual ABOUT PMKSY Har Khet ko Pani  Prime Minister Krishi Sinchayee Yojana  Government of India is committed to accord high priority to water conservation and its management. To this effect Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) has been formulated with the vision of extending the coverage",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 2
  },
  {
    "content": " of irrigation  Har Khet ko pani  and improving water use efficiency  More crop per drop  in a focused manner with end to end solution on source creation, distribution, management, field application and extension activities. The Cabinet Committee on Economic Affairs chaired by Hon ble Prime Minister has accorded approval of Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) in its meeting held on 1st July, 2015. DA FW is implementing Per Drop More Crop scheme which is operational from 2015-16 in the",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 3
  },
  {
    "content": " Country. The Per Drop More Crop scheme mainly focuses on water use efficiency at farm level through Micro Irrigation (Drip and Sprinkler Irrigation System). PDMC is being implemented under RKVY from 2022-23. know more about PMKSY Important Links PFDCs Research Findings on Fertigation Operational Guidelines of Pradhan Mantri Krishi Sinchayee Yojana (PMKSY)   Micro Irrigation Fund (MIF) Revised MoA and ToR of Operational Guidelines of Pradhan Mantri Krishi Sinchayee Yojana (PMKSY)   Micro Irrigat",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 4
  },
  {
    "content": "ion Fund (MIF) Revised Guidelines of PMKSY Per Drop More Crop (Micro Irrigation) GUIDELINES FOR STATE DBT CELL Mobile App for Micro Irrigation Other Interventions View more News and Announcements Utilisation of unspent funds out of grant-in-aid released in previous financial year (2020-21) for implementation of Per Drop More Crop component of Pradhan Mantri Krishi Sinchayee Yojana (PMKSY-PDMC) during FY 2021-22 - Revalidation regarding Proceedings of Webinar on  Use of Micro-irrigation for Enhan",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 5
  },
  {
    "content": "ced Water Use Efficiency  held on Date: 17.8.2020 at 4.30 P.M, Krishi Bhawan, New Delhi Annual allocation of Central Share for implementation of Per Drop More Crop component of Pradhan Mantri Krishi Sinchayee Yojana (PMKSY-PDMC) during FY 2020-21 Operationalisation of PMKSY   Micro Irrigation Fund (MIF) FAQ s of PMKSY View more Last Update on: 12 Jun 2019 Website Policies Sitemap National Portal of India FAQ in English FAQ in Hindi Visitor Count : 793310 This site is Designed   Developed by DAD ",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 6
  },
  {
    "content": "IT, DA FW, Ministry of Agriculture. Content published and Managed by RFS Division, DAC FW, Ministry of Agriculture   Farmers Welfare, Government of India For any query and suggestions Please write a mail to support dot pmksy-dac at gov dot in",
    "source": "https://pmksy.gov.in/",
    "type": "scraped_website",
    "title": "pmksy.gov.in",
    "chunkIndex": 7
  },
  {
    "content": "AGRI FARMING Agriculture Farming Livestock Farming Project Reports Hydroponics Best Fertilizers Vertical Farming Sheep Farming Goat Farming Poultry Farming Fish Farming Pig Farming Dairy Farming Rabbit Farming Success Stories of Farmers Boost Fruit Yield District Wise Crop Production Schemes   Subsidies Agriculture Colleges FAQs Gardening Farm Insurance Disease Control And Management AGRI FARMING Agri Farming Agriculture Aquaculture Horticulture Livestock Poultry Gardening Project Reports Agri B",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 0
  },
  {
    "content": "usiness FAQs AGRI FARMING Agri Farming Search the Site Contact Us AGRI FARMING Agriculture Farming Livestock Farming Project Reports Hydroponics Best Fertilizers Vertical Farming Sheep Farming Goat Farming Poultry Farming Fish Farming Pig Farming Dairy Farming Rabbit Farming Success Stories of Farmers Boost Fruit Yield District Wise Crop Production Schemes   Subsidies Agriculture Colleges FAQs Gardening Farm Insurance Disease Control And Management Agriculture Aquaculture Horticulture Livestock ",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 1
  },
  {
    "content": "Poultry Gardening Project Reports Agri Business Gardening Best Compost for Tomato Plants: 15 DIY Recipes for Juicy Yields Agriculture Farming Save Money, Prevent Breakdowns: A Simple Maintenance Checklist for Tractors Aquaculture How Often to Feed Shrimp?: Best Feeding Schedule for Faster Prawn Growth Gardening How to Keep Indoor Plants Alive: 15 Natural Strategies for Houseplant Care Gardening Best Indoor Flowering Plants for Indian Homes: Creating Spaces with Low-Maintenance Blooms Gardening H",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 2
  },
  {
    "content": "ow to Grow Philodendron Indoors: A 15-Step Planting and Caring Guide Gardening How to Grow Hyacinth Bulbs: A 15-Step Comprehensive Guide for Planting and Care Horticulture Indoor Saffron Farming: Training, Costs, and Profit in India Agri Business How to Start Greenhouse Farming in the UK: Crafting a Robust Business Plan Gardening How to Grow Anthurium Indoors: A 15-Step Planting and Care Guide for Potted Flamingo Flowers Project Reports Layer Farming Project Report Model for 500 Birds Horticultu",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 3
  },
  {
    "content": "re Aloe Vera Farming Profit Per Acre: Cost, Yield, and Contract Farming in India Horticulture Medicinal Plants Farming Profit per Acre: Cost and Return Analysis in India Poultry Farming How to Start a Chicken Farm for Eggs: Everything You Need to Know Poultry Farming What Vegetables Can Chickens Eat: A Comprehensive Guide for Chicken Owners Horticulture Ashwagandha Farming Profit and Cost: 1 Acre Cultivation Analysis in India Agri Business How to Produce Premium Goat Cheese for Local Markets in ",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 4
  },
  {
    "content": "Spain Aquaculture How to Raise Shrimp in Aquaponics: 15-Step Farming and Breeding Guide Gardening Ginger Farming Techniques In Container Gardening Agri Business Top Agriculture Companies in India: Best and List Livestock Farming Sheep Farming in Kenya: How to Start, Breeds, Loans, Zero Grazing, and Feeding for Beginners Poultry Farming How to Raise Welsummer Chickens: A Comprehensive Guide for Beginners Livestock Farming Dairy Entrepreneurship Development Scheme in India: DEDS Benefits, Eligibil",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 5
  },
  {
    "content": "ity, and How to Apply Agriculture Farming Soil Erosion Causes, Types, Soil Conservation Methods Agriculture Farming Seed Sowing and Harvesting Chart for Vegetables in the USA Agriculture Farming Composting Manure   Methods, Process Horticulture Cauliflower Farming in Polyhouse (Gobi) for Profit",
    "source": "https://www.agrifarming.in/",
    "type": "scraped_website",
    "title": "www.agrifarming.in",
    "chunkIndex": 6
  },
  {
    "content": "World Food India 2025 Concludes on a Historic Note with Investment Commitments Crossing Rs 1 Lakh Crore India-Argentina Strengthen Ties with Focus on Vegetable Oil Trade and Agricultural Cooperation PM Modi Launches Bihar s Mukhyamantri Mahila Rojgar Yojana, Rs 7,500 Crore Directly Transferred to 75 Lakh Women CropLife India Maps USD 1 Trillion Agri Economy Vision Aditya A. Shriram Elected President of Alkali Manufacturers Association of India; Prashant J. Mahale Becomes Vice President Indian Ag",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 0
  },
  {
    "content": "riculture in Transition: From Policy Promises to Ground Realities on the Road to Viksit Bharat Govt Approves Rs 13,890 Crore Procurement of Pulses and Oilseeds in UP, Gujarat for Kharif 2025 26 PM-KISAN 21st Instalment: Rs 540 Crore Transferred to 27 Lakh Farmers in Himachal Pradesh, Punjab, and Uttarakhand Centre Launches  National Initiative on Water Security , 65  MGNREGA Funds to Go for Water Works in Over-Exploited Blocks Polyhouse Farming: Govt Schemes Offer Up to Rs 56 Lakh to Help Farmer",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 1
  },
  {
    "content": "s Grow High-Value Crops Year-Round  Top on Krishi Jagran PM Kisan Kharif Crops News Bulletin View More Dr. P. Chandra Shekara : A visionary leader reshaping rural development and agriculture globally MFOI 2024 Ratan Tata s Last Goodbye: The Legacy of India s Greatest Industrialist   ratantata  tata  trending AgriSure Fund:  750 Crore for Agri-Startups! Is this the Future of Farming?  modi  agriculture Organic Farming Explained: Benefits, Techniques   Training Centres in India   farming  agricult",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 2
  },
  {
    "content": "ure Browse News Feeds Crop Calendar Agriculture Dictionary Wiki Jobs Quiz Tractors FTB Organic Agriculture Apps Directory Events News View More FAO Report Highlights Slow Progress on 22 SDG Indicators; 2.3 billion Face Food Insecurity 8 Reasons to Start Your Day with Just One Soaked Anjeer 17th Edition of AgraME 2025 Returns to Dubai: Middle East s Premier Trade Show for Agri-Food and Farming Professionals India to Launch Electronic Observer System for Marine Fish Monitoring: Govt Kharif Sowing ",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 3
  },
  {
    "content": "Crosses 1120 Lakh Ha; Rice   Cereals Rise, Oilseeds Fall Leads Agri Genetics Launches India s First Privately-Owned Integrated Centre of Excellence for Cattle and Plant Genomics Albaugh 2024 Sustainability Report Highlights Actions Haryana Agriculture Department Seizes Fake Agro-Chemicals Worth Rs 8 Lakh in Kaithal Raid More News Feeds We re on WhatsApp! Join our WhatsApp group and get the most important updates you need. Daily. Join Our WhatsApp Channel Subscribe to our Newsletter. You choose t",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 4
  },
  {
    "content": "he topics of your interest and we ll send you handpicked news and latest updates based on your choice. Subscribe Newsletters Web Stories Essential Garden Care Products Every Home Gardener Needs! 7 Most Expensive Foods in the World Why Flaxseeds Deserve a Spot in Your Diet? 7 Essential Tips for Food Safety Agriculture World View More FAO Report Highlights Slow Progress on 22 SDG Indicators; 2.3 billion Face Food Insecurity FAO Welcomes WTO Fisheries Subsidies Agreement to Curb Illegal Fishing, Pr",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 5
  },
  {
    "content": "omote Sustainability Global Food Prices Steady in August; FAO Forecasts Record Cereal Production Amid Rising Fertilizer Costs IRRI Launches four High-Yield Rice Varieties in DRC to Enhance Food Security and Farmer Incomes Global Food Prices Climb in July as Vegetable Oils Hit 3 Year High, Meat at Record Levels FAO and UK Launch ReAL Project to Support Over 1.5 Lakh Afghans Facing Food Insecurity and Climate Crisis FAO Launches Global Soil Biodiversity Observatory to Protect Life below Ground Glo",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 6
  },
  {
    "content": "bal Demand for Meat and Dairy to Rise by 2034 in Developing Countries, Finds FAO-OECD Report ICRISAT to Operate as CGIAR s Breeding Resources Hub for South Asia, Accelerating Regional Crop Improvement Global Food Prices Rise Slightly in June 2025 as Meat, Dairy, And Vegetable Oil Costs Climb: FAO Health   Lifestyle 8 Reasons to Start Your Day with Just One Soaked Anjeer KJ Staff Soya Beetroot Pulao: A Nutritious Twist to Your Everyday Rice! KJ Staff Try These 8 Healthy and Delicious Sweet Potato",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 7
  },
  {
    "content": " Recipes KJ Staff Avocado Goes Desi: A Flavor-Packed Indian Twist You Must Try! KJ Staff Sattu Paratha: A High-Protein Breakfast from Bihar KJ Staff 5 Supergrains You Can Consume During Navratri Fasting Without Breaking Any Rules KJ Staff 7 Delicious Zero-Carb Dinners to Fuel Your Body Without the Bloat KJ Staff Mushroom Ghee Roast: A Fiery South Indian Twist on Vegetarian Comfort Food KJ Staff Turmeric Ginger Tea: Your Go-To Remedy for Cough, Cold   Comfort KJ Staff 9 Protein-Rich Indian Currie",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 8
  },
  {
    "content": "s Without Paneer or Dal KJ Staff Beetroot Dosa: A Nutritious Twist on Traditional South Indian Flavor That Boosts Health   Taste KJ Staff Thakkali Sadam: South India s Tangy, Spiced Tomato Rice Delight KJ Staff Lauki Love: 10 Delicious Indian Dishes That Celebrate This Super Veggie KJ Staff Chocolate Banana Pancakes: Enjoy a Wholesome Treat That Feels Like Dessert Every Morning KJ Staff Mental Health: Effects of Poor Sleep and Lifestyle, and How to Prevent Them Laavanya Arya Coconut Jaggery Ladd",
    "source": "https://krishijagran.com/",
    "type": "scraped_website",
    "title": "krishijagran.com",
    "chunkIndex": 9
  },
  {
    "content": "Rabi crops are winter crops sown in October-December and harvested in March-April. Major crops: Wheat, Barley, Mustard, Peas, Gram, Lentils, Chickpeas. These require cool weather for growth and irrigation for development.",
    "source": "agricultural_knowledge",
    "type": "crops_seasons",
    "title": "Winter Crops (Rabi Season)",
    "chunkIndex": 0
  },
  {
    "content": "Kharif crops are monsoon crops sown with the onset of rains in June-July and harvested in September-October. Major crops: Rice, Maize, Cotton, Soybean, Groundnut, Sugarcane, Turmeric. These depend heavily on monsoon rains.",
    "source": "agricultural_knowledge",
    "type": "crops_seasons",
    "title": "Summer Crops (Kharif Season)",
    "chunkIndex": 0
  },
  {
    "content": "Organic farming avoids synthetic chemicals and uses natural methods: Crop rotation, green manure, compost, biological pest control, and mechanical cultivation. Benefits: Improves soil health, reduces pollution, and produces chemical-free food.",
    "source": "agricultural_knowledge",
    "type": "farming_practices",
    "title": "Organic Farming Methods",
    "chunkIndex": 0
  },
  {
    "content": "Crop rotation involves growing different crops sequentially on the same land. Benefits: Prevents soil depletion, controls pests and diseases, improves soil structure, and increases fertility. Example: Rice-Wheat-Pulses rotation.",
    "source": "agricultural_knowledge",
    "type": "farming_practices",
    "title": "Crop Rotation Benefits",
    "chunkIndex": 0
  },
  {
    "content": "Efficient irrigation methods: Drip irrigation (water directly to roots), sprinkler systems (simulated rainfall), and subsurface irrigation. Benefits: Water conservation, reduced evaporation, and better crop yield.",
    "source": "agricultural_knowledge",
    "type": "soil_irrigation",
    "title": "Modern Irrigation Methods",
    "chunkIndex": 0
  },
  {
    "content": "Proper soil preparation includes: Plowing to loosen soil, leveling for even water distribution, adding organic matter/compost, and soil testing for nutrient analysis. Different crops require different soil pH levels.",
    "source": "agricultural_knowledge",
    "type": "soil_irrigation",
    "title": "Soil Preparation Techniques",
    "chunkIndex": 0
  },
  {
    "content": "Micro Irrigation component of PMKSY focuses on water use efficiency through drip and sprinkler irrigation. Subsidy: 55% for small farmers, 45% for others. Benefits: 30-50% water saving, 20-30% yield increase.",
    "source": "government_knowledge",
    "type": "government_schemes",
    "title": "PMKSY - Per Drop More Crop",
    "chunkIndex": 0
  },
  {
    "content": "Provides farmers with soil health cards every 3 years. Shows nutrient status and recommends appropriate fertilizer dosage. Helps in balanced fertilizer use and improved soil health.",
    "source": "government_knowledge",
    "type": "government_schemes",
    "title": "Soil Health Card Scheme",
    "chunkIndex": 0
  },
  {
    "content": "Rabi crops are winter crops sown in October-December and harvested in March-April. Major crops: Wheat, Barley, Mustard, Peas, Gram, Lentils, Chickpeas. These require cool weather for growth and irrigation for development.",
    "source": "agricultural_knowledge",
    "type": "crops_seasons",
    "title": "Winter Crops (Rabi Season)",
    "keywords": [
      "winter",
      "rabi",
      "wheat",
      "barley",
      "mustard",
      "harvest",
      "season",
      "october",
      "december",
      "march",
      "april"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Kharif crops are monsoon crops sown with the onset of rains in June-July and harvested in September-October. Major crops: Rice, Maize, Cotton, Soybean, Groundnut, Sugarcane, Turmeric. These depend heavily on monsoon rains.",
    "source": "agricultural_knowledge",
    "type": "crops_seasons",
    "title": "Summer Crops (Kharif Season)",
    "keywords": [
      "summer",
      "kharif",
      "monsoon",
      "rice",
      "maize",
      "cotton",
      "rainy",
      "june",
      "july",
      "september",
      "october"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Crops with consistently high market demand in India: Basmati Rice (export demand), Wheat (staple food), Pulses (protein source), Fruits & Vegetables (daily consumption), Spices (turmeric, chili for export), Medicinal Plants (growing demand), Organic Produce (premium markets). Market demand varies by region and season.",
    "source": "agricultural_knowledge",
    "type": "market_economics",
    "title": "High Demand Crops in Indian Market",
    "keywords": [
      "market demand",
      "high demand",
      "profitable",
      "price",
      "market",
      "economics",
      "business",
      "income"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Major export crops from India: Basmati Rice, Spices (turmeric, chili, pepper), Tea, Coffee, Cashew, Sugarcane products, Fruits (mango, banana), Vegetables (onion, potato). These have good international market demand and fetch premium prices.",
    "source": "agricultural_knowledge",
    "type": "market_economics",
    "title": "Export Oriented Crops",
    "keywords": [
      "export",
      "international",
      "foreign",
      "premium",
      "price",
      "demand",
      "market"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Organic farming avoids synthetic chemicals and uses natural methods: Crop rotation, green manure, compost, biological pest control, and mechanical cultivation. Benefits: Improves soil health, reduces pollution, and produces chemical-free food.",
    "source": "agricultural_knowledge",
    "type": "farming_practices",
    "title": "Organic Farming Methods",
    "keywords": [
      "organic",
      "natural",
      "compost",
      "pest control",
      "soil health",
      "chemical-free"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Crop rotation involves growing different crops sequentially on the same land. Benefits: Prevents soil depletion, controls pests and diseases, improves soil structure, and increases fertility. Example: Rice-Wheat-Pulses rotation.",
    "source": "agricultural_knowledge",
    "type": "farming_practices",
    "title": "Crop Rotation Benefits",
    "keywords": [
      "crop rotation",
      "soil fertility",
      "pest control",
      "sequential cropping",
      "rotation"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Efficient irrigation methods: Drip irrigation (water directly to roots), sprinkler systems (simulated rainfall), and subsurface irrigation. Benefits: Water conservation, reduced evaporation, and better crop yield.",
    "source": "agricultural_knowledge",
    "type": "soil_irrigation",
    "title": "Modern Irrigation Methods",
    "keywords": [
      "irrigation",
      "drip",
      "sprinkler",
      "water conservation",
      "watering",
      "water management"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Proper soil preparation includes: Plowing to loosen soil, leveling for even water distribution, adding organic matter/compost, and soil testing for nutrient analysis. Different crops require different soil pH levels.",
    "source": "agricultural_knowledge",
    "type": "soil_irrigation",
    "title": "Soil Preparation Techniques",
    "keywords": [
      "soil preparation",
      "plowing",
      "compost",
      "soil testing",
      "pH",
      "fertilizer"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Micro Irrigation component of PMKSY focuses on water use efficiency through drip and sprinkler irrigation. Subsidy: 55% for small farmers, 45% for others. Benefits: 30-50% water saving, 20-30% yield increase.",
    "source": "government_knowledge",
    "type": "government_schemes",
    "title": "PMKSY - Per Drop More Crop",
    "keywords": [
      "pmksy",
      "irrigation",
      "subsidy",
      "water efficiency",
      "drip",
      "sprinkler",
      "government scheme"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Provides farmers with soil health cards every 3 years. Shows nutrient status and recommends appropriate fertilizer dosage. Helps in balanced fertilizer use and improved soil health.",
    "source": "government_knowledge",
    "type": "government_schemes",
    "title": "Soil Health Card Scheme",
    "keywords": [
      "soil health",
      "fertilizer",
      "nutrient",
      "government scheme",
      "soil card"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Wheat is a major Rabi crop. Best soil: Well-drained loamy soil. Sowing: October-November. Harvesting: March-April. Water requirements: 4-6 irrigations. Major varieties: HD-2967, PBW-550, DBW-17. Average yield: 4-5 tons/hectare.",
    "source": "agricultural_knowledge",
    "type": "crop_guides",
    "title": "Wheat Cultivation Guide",
    "keywords": [
      "wheat",
      "cultivation",
      "rabi",
      "cereal",
      "staple",
      "food grain"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Rice is a major Kharif crop. Best soil: Clayey loam with good water retention. Sowing: June-July. Harvesting: September-October. Water requirements: Standing water. Major varieties: Pusa Basmati, Samba Mahsuri. Average yield: 3-4 tons/hectare.",
    "source": "agricultural_knowledge",
    "type": "crop_guides",
    "title": "Rice Cultivation Guide",
    "keywords": [
      "rice",
      "paddy",
      "kharif",
      "staple",
      "food grain",
      "basmati"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Integrated Pest Management (IPM) includes: Cultural methods (crop rotation), biological control (natural predators), mechanical methods (traps), and chemical pesticides as last resort. Always follow recommended dosage and safety periods.",
    "source": "agricultural_knowledge",
    "type": "farming_practices",
    "title": "Pest Control Methods",
    "keywords": [
      "pest control",
      "insects",
      "diseases",
      "ipm",
      "pesticides",
      "crop protection"
    ],
    "chunkIndex": 0
  },
  {
    "content": "Balanced fertilizer use based on soil testing. Nitrogen (N), Phosphorus (P), Potassium (K) in right proportions. Organic fertilizers: Farmyard manure, compost. Inorganic: Urea, DAP, MOP. Split application improves efficiency.",
    "source": "agricultural_knowledge",
    "type": "farming_practices",
    "title": "Fertilizer Management",
    "keywords": [
      "fertilizer",
      "nutrients",
      "npk",
      "manure",
      "compost",
      "soil fertility"
    ],
    "chunkIndex": 0
  }
]